luk8426/microcontroller/_mcpr_stm32f407_all.c
/**
  ******************************************************************************
  * @file    _mcpr_stm32f407_all.c
  * @author  STM, modified by L. Gaul
  * @version V4.1.1
  * @date    26-May-2020 last revision
  * @brief   based on _mcpr_stm32f407_fsmc.c V2.2.0:
  *          V4.1.0: Emulate_RKTYC included
  *                  based on EXTI of PB15 to detect load/discharge of capacitor
  *                  switches pulls of PC8/PC9, controlled by Timer 2, to emulate charge/discharge 
  *                  and comparator inputs
  *                  very sensitve to disturbancies, okay on stand-alone Discovery-Board, notokay with LCD and FSMC!
  *                       (may be due to weak defintion of levels by high ohmic pulls)
  *          V4.0.1: wait replaced by _waitemu_
  *          V4.0.0:
  *          LEDs-LCD-Emulator, based on Memory Protection Unit to catch access to LEDs and LCD           	
  *             relies on stacking of register with LEDs/LCD-adress during Memory Management Fault
  *					 activation of fsmc (external memory bus interface to LCD and 16LEDs)
	*					    depends on definition of USE_FSMC (acitvated) or NO_FSMC (not activated) else error
  *             if/elif in SystemInit_ExtMemCtl() located to avoid warning
  *             
	*          preceding _mcpr_stm32f407_fsmc.c, V2.2.0:
	*          File system_stm32f4xx.c (V2.1.0 modified by ARM, 19-Juni-2014) 
	*          included by µVision 5.13 package manager
  *          misses SetSysClock() to reconfigure PLL.	
  *          This file provides SetSysClock from original system_stm32f4xx.c 
  *          (see below). 
  *          Renaming of names (function, defines) with prefix mcpr_
  *          Initialisation of FSMC (Bank 1, SRAM, async, for lab LEDs + LCD) 
	*
  *
  * Modifications to default configuration:
  *=============================================================================
  *                                               | Default Value                  
  *-----------------------------------------------------------------------------
  *        Supported STM32F4xx device revision    | Rev A
  *-----------------------------------------------------------------------------
  *        System Clock source                    | PLL (HSE)
  *-----------------------------------------------------------------------------
  *        SYSCLK(Hz)                             | 168000000
  *-----------------------------------------------------------------------------
  *        HCLK(Hz)                               | 168000000
  *-----------------------------------------------------------------------------
  *        AHB Prescaler                          | 1
  *-----------------------------------------------------------------------------
  *        APB1 Prescaler                         | 4
  *-----------------------------------------------------------------------------
  *        APB2 Prescaler                         | 2
  *-----------------------------------------------------------------------------
  *        HSE Frequency(Hz)                      | 8000000
  *-----------------------------------------------------------------------------
  *        mcpr_PLL_M                             | 8
  *-----------------------------------------------------------------------------
  *        mcpr_PLL_N                             | 336
  *-----------------------------------------------------------------------------
  *        mcpr_PLL_P                             | 2
  *-----------------------------------------------------------------------------
  *        mcpr_PLL_Q                             | 7
  *-----------------------------------------------------------------------------
  *=============================================================================
  */
	
#include "_mcpr_stm32f407.h"

#include "stm32f4xx.h"

#include "stdio.h"		

static void mcpr_SetSysClock(void);
static void SystemInit_ExtMemCtl(void);


void mcpr_SetSystemCoreClock(void) {
	// Clock Reconfigration  
	mcpr_SetSysClock();
	// Update global variable SystemCoreClock
	//    Defintion in system_stm32f4xx.c
	SystemCoreClockUpdate();	
	SystemInit_ExtMemCtl();
}

//void mcpr_SetSystemCoreClock(void) {
//     // Clock Reconfigration
//     mcpr_SetSysClock();
//     // Update global variable SystemCoreClock
//     //    Defintion in system_stm32f4xx.c
//     SystemCoreClockUpdate();
//#if defined(USE_FSMC)
//     SystemInit_ExtMemCtl();
//#elif defined(NO_FSMC)
//     // keine Initialisierung notwendig
//#else
//	#error Definition of FSMC macro is missing 
//#endif 
//}

void mcpr_ConfigSystemTick(void) {
	// SysTick System Timer Configuration, requests periodically 
	//           a SysTick_Handler, e.g. void SysTick_Handler(void) {   }
	//    Missing SysTick_Handler results in loop for ever in startup_stm32f407xx.s
	//    Definition of SysTick_Config in core_cm4.h 
	  if (SysTick_Config(SystemCoreClock / 1000)) { /* SysTick 1 msec interrupts  */
    while (1);                                  /* Capture error              */
  }
}
//

void mcpr_SetSysClockTick(void) {
	mcpr_SetSystemCoreClock();
	mcpr_ConfigSystemTick();
}


/******************************************************************************
  * @brief  Configuration Emulation of HW-Access to LEDs (0x60020000) and LCDs (0x60000000, 0x60100000)
  *         Uses Memory Management Protection Fault to LEDs/LCD Adresses
  *         Manipulates Stack, based on Stacking of Fault-Handler, works if R0-R3 is used to adress LEDs/LCD
  *
  *         Place Emulate_LEDsLCD (unsigned int rows, unsigned int cols) at beginning of Polling-Loop
  *         use Debug (printf) viewer (terminal mode required) to display LEDs  and LCD
  * @param  rows = number of displayed pixels in y-dir (0...239) 
  *         cols = number of displayed pixels in x-dir (0...319)
  * @retval None
  *****************************************************************************/

// globals for Emulate_LEDsLCD

// simulation of printf is perfect,
// execution of printf over trace-port to IDE is to slow
#if (HSI_VALUE==168000000)  // simulation setting
  #define PRINTPERIODms  0         
  #define WAITUS 0 
  #define ROWMAXPP 512
#else                       // Board targets
  #define PRINTPERIODms  150         
  #define WAITUS 200 
  #define ROWMAXPP 8
#endif


#ifdef USE_EMULATOR    // use emulator for LCD and LEDs

