luk8426/microcontroller/_mcpr_stm32f407_all.c
// ---------------- RKTY*C EMULATOR ---------------------
// ======================================================

unsigned char state_emukty=0;     // state machine: 0=empty, 11=empty charging, 12=half charging, 13=full charging, 4=full
                                  //                         21=empty disch.  , 22=half disch.  , 23=full disch.
signed short  temp_emukty=250;
const signed short  del_emukty_11=20,  del_emukty_12=50,   del_emukty_13=5;
const signed short  del_emukty_21=200, del_emukty_22=500,  del_emukty_23=50;

// PB15 changed
void EXTI15_10_IRQHandler (void) {
  unsigned short load_emukty=0;
  int del=0;
  EXTI->PR |= (1 <<15);   // clear pending flag
  load_emukty = (GPIOB->IDR & 0x8000) >> 15;
  if (load_emukty) {        // PB15 is high, charging C
    switch (state_emukty) { 
      case  0:
      case 21:
      case 11: state_emukty=11; del=del_emukty_11;  break;
      case 12:
      case 22: state_emukty=12; del=del_emukty_12;  break;
      case 13:
      case 23: state_emukty=13; del=del_emukty_13;  break;
      case  4: state_emukty=13; del=del_emukty_13;  break;
      default: state_emukty=0;
    }
  } else {                // PB15 is low, discharging C
    switch (state_emukty) { 
      case  0:
      case 21:
      case 11: state_emukty=21; del=del_emukty_21;  break;
      case 12:
      case 22: state_emukty=22; del=del_emukty_22;  break;
      case 13:
      case 23: state_emukty=23; del=del_emukty_23;  break;
      case  4: state_emukty=23; del=del_emukty_23;  break;
      default: state_emukty=0;
    }
  }
  if (state_emukty) {
    TIM2->CNT  = 0;
    TIM2->ARR  = del;
    TIM2->CR1 |= 0x1;
  } else {
    TIM2->CR1 &= ~0x1; // stop      
    GPIOC->PUPDR = (GPIOC->PUPDR & 0xFFF0FFFF) | (0b1010 << 16);   // pulls down
  }
}

void TIM2_IRQHandler (void) {
  unsigned int pullmask=0, del=0;
  TIM2->CR1 &= ~0x1;  // stop
  TIM2->SR = 0x0000;  // Service-Request has to be cleared by SW!
  switch (state_emukty) { 
    case 11: state_emukty=12; pullmask=0b0110; del=del_emukty_12; break; // PC9 high, PC8 low
    case 12: state_emukty=13; pullmask=0b0101; del=del_emukty_13; break; // PC9 high, PC8 high
    case 13: state_emukty= 4; pullmask=0b0101; break; // PC9 high, PC8 high
    case  4: state_emukty=23; pullmask=0b0101; del=del_emukty_23; break; // must not occur!!! PC9 high, PC8 high
    case 23: state_emukty=22; pullmask=0b0110;    // PC9 high, PC8 low
                                               del = ((temp_emukty - 250)*79/100+1000)*114/100;  // linear approx. of RKTY
                                               break;
    case 22: state_emukty=21; pullmask=0b1010; del=del_emukty_21; break; // PC9 low, PC8 low
    case 21: state_emukty= 0; pullmask=0b1010; break; // PC9 low, PC8 low
    case 0:  // must not occur !!! 
    default: state_emukty=0;
  }
  GPIOC->PUPDR = (GPIOC->PUPDR & 0xFFF0FFFF) | (pullmask << 16);   // pulls  
  if (del) {
    TIM2->ARR  = del; // delay time
    TIM2->CR1 |= 0x1; // run
  }
}

// Initialisation of RKTY*C Emulator
// PB15 loads C, PC8 is upper threshold, PC9 is lower threshold
// fully charged C: PC8=1, PC9=1; half charged C: PC8=0, PC9=1; empty C: PC8=0, PC9=0
void Emulate_RKTYC (signed short invtemp){
  unsigned char static flag_init_emukty=0;
  
  if (flag_init_emukty) {
    
  } else {
    RCC->AHB1ENR |= 0x0006;   // Port B, C clock on
    GPIOB->ODR   &= 0x8000;   // PB15 off
    GPIOC->PUPDR = (GPIOC->PUPDR & 0xFFF0FFFF) | (0b1010 << 16);   // pulls down
    // configure PB15 as source for EXTI15 line
    EXTI->IMR |= (1 <<15);    // unmask interrupt line 15 (includes PB15)
    EXTI->EMR |= (1 <<15);    // unmask event line 15 
    EXTI->RTSR |= (1 <<15);    // rising edge selected
    EXTI->FTSR |= (1 <<15);    // falling edge selected 
    RCC->APB2ENR |= (1 <<14);         // switch on clock for system configutation controller
    SYSCFG->EXTICR[3] = 0x00001000;   // PB15 is source for EXTICR4 = EXI15
    NVIC_EnableIRQ(EXTI15_10_IRQn);   // TIM12_IRQn=43 in stm32f407xx.h
    flag_init_emukty = 1;

    RCC->APB1ENR   |= RCC_APB1ENR_TIM2EN; 								// Enable Clock for Timer 2 (Bit 0) 
    DBGMCU->APB1FZ |= DBGMCU_APB1_FZ_DBG_TIM2_STOP;				// Clock for Timer 2 stops if Core halts in Debug mode (Bit 0)
    TIM2->PSC = 83;                     // Prescaler, divides Timer 2 Clock by (PSC1+1) = 84 -> 1MHz Timer Tick
    TIM2->ARR = 999;                 		// ARR + 1 ticks for CNT to overflow and reset to 0 -> 	1MHz Timer Tick results in 1ms Period
    TIM2->CNT = 0x0000;                 // Counter, Timer 2 only upcouting
    TIM2->CR1 = 0x0004;                 // interrupt request only on overflow,
    TIM2->EGR = 0x0001;                 // Bit0=1:  
    TIM2->DIER = 0x0001;                 // Bit0=1:  Interrupt Request Enabled
    NVIC_EnableIRQ(TIM2_IRQn);          // Funktion in core_cm4.h beschrieben im Programming Manual 4.3.1, TIM2_IRQn=28 in stm32f4xx  
    temp_emukty=invtemp*10;
  }
};



// -------------- LCD-LEDS EMULATOR ---------------------
// ======================================================

#define HWADRESS_LEDS 0x60020000
#define HWADRMSK_LCD  0x60FF0000
#define HWADRESS_LCD_COMMAND 0x60000000
#define HWADRESS_LCD_DATA 0x60100000
unsigned char  qflag=0;  // last hw-access_data unvalid
unsigned char  time2printflag=0;  // 
unsigned int   hwaccess_adress, hwhfa;
unsigned short hwaccess_data, lcd_command=0, lcd_data=0, leds;
unsigned char  lcdmatrix[240][320], ledsarray[16];
unsigned int   xcursor, ycursor, invalid=0, busfaultcounter=0;


// whyever, otherwise printf is not redirected to debug ouput window
int fputc(int c, FILE *f) {
  return(ITM_SendChar(c));
}

__attribute__((always_inline)) void Interpret_LEDsLCD(unsigned int do_lcd) {
    unsigned short tmp;
    if (qflag) {
      if ( (hwaccess_adress & HWADRESS_LEDS) == HWADRESS_LEDS) { // LEDs
          leds = hwaccess_data;
      } else if (hwaccess_adress == HWADRESS_LCD_COMMAND) { // LCD command
          lcd_command = hwaccess_data;
      } else if ( (hwaccess_adress & HWADRMSK_LCD) == HWADRESS_LCD_DATA) {  // LCD data, using last LCD command to interpret
          lcd_data    = hwaccess_data;
          if (lcd_command == 0x4E) {
            xcursor = lcd_data;}
          if (lcd_command == 0x4F) {
            ycursor = lcd_data;}
          if (lcd_command == 0x22) {
            tmp = lcd_data;
            if (do_lcd) lcdmatrix[ycursor][xcursor] = 0x20+(unsigned char)((tmp&0x18)>>3)|((tmp&0x600)>>7)|((tmp&0xC000)>>10);
            xcursor++;
          }
        if (xcursor>=320) {xcursor=0; ycursor++;}
        if (ycursor>=240) ycursor=0;
      } else {  // invalid adress ?
          invalid++;
      }
      qflag = 0;
    }  
}

void _waitemu_(unsigned int us) {
  volatile unsigned int i;
  for (i=0; i<us; i++) {}
}

// emulation of LCD and LEDs by catching writes to hw-adresses causing memory protectdion fault
void Emulate_LEDsLCD (unsigned int rows, unsigned int cols) {
	unsigned char static flag_init=0, LEDcolor[4]={'R', 'Y', 'G', 'B'}; 
  int i, j;  
  unsigned int static lcols, lrows, rowstart=0, rowend=ROWMAXPP;
    
  // print writes from catched hw-accesses
  if (flag_init) { 	
    MPU->CTRL  =  0; // MPU is active only for one polling loop pass after completed print
    if (time2printflag) {
      if (PRINTPERIODms) time2printflag = 0;  // no time slicing for simulation
      // catch last data from fault
      Interpret_LEDsLCD(rows);
      if ((rowstart==0) && (cols)) {  // rows==0: only LEDs if cols>0
        printf("%c[%i;%if", 27, 0, 0);
        // Display LEDs in Debug (printf) viewer (terminal mode required)
        printf("\n"); _waitemu_(WAITUS);printf("\n"); _waitemu_(WAITUS);
        printf("16LEDS Bit 15 ... 0, Nibbles\n");
        for (i=15; i>=0; i--) {
           if (leds & (1<<i)) ledsarray[i]=LEDcolor[i/4]; else ledsarray[i]='.';
           printf("%c", ledsarray[i]); _waitemu_(WAITUS);
           if (i%4 == 0) printf(" "); _waitemu_(WAITUS);
        }  printf("\n\n"); _waitemu_(WAITUS);
        if (rows) {
          lcols = (((cols-1)%320)/10 + 1)*10; lrows = (((rows-1)%240)/10 + 1)*10;
          printf("LCD: 1 character corresponds to 1 pixel, character = color, ' ' = black\n|");
          for (i=0; i<cols/10; i++) {
             printf("---------|"); _waitemu_(WAITUS);
          }  
          printf("\n"); _waitemu_(WAITUS);
        } else {
          lrows = 0;
        }
      }
      // Display LCD in Debug (printf) viewer (terminal mode required)
      if (lrows) {
//        cols = ((cols%320)/10)*10; rows = ((rows%240)/10)*10;
//        printf("LCD: 1 character corresponds to 1 pixel, character = color, ' ' = black\n|");
//        for (i=0; i<cols/10; i++) {
//           printf("---------|");_waitemu_(WAITUS);
//        }  printf("\n");_waitemu_(WAITUS);
        if (lrows <= rowend) rowend=lrows;
        for (j=rowstart; j<rowend; j++) {
           if ((j+1)%10) printf("|"); else printf("-"); _waitemu_(WAITUS);
           for (i=0; i<lcols; i++) {
              printf("%c", lcdmatrix[j][i]); _waitemu_(WAITUS);
           }  
           printf("\n"); _waitemu_(WAITUS);
         }
         if (rowend==lrows) {
            rowstart = 0; rowend = ROWMAXPP;
            MPU->CTRL  =  MPU_CTRL_PRIVDEFENA_Msk | MPU_CTRL_ENABLE_Msk;
         } else {
            rowstart = rowend; rowend = rowend + ROWMAXPP; 
         }
      } else {
            MPU->CTRL  =  MPU_CTRL_PRIVDEFENA_Msk | MPU_CTRL_ENABLE_Msk;
      }
     } 
  // first call: init emulation    
  } else {					
    mcpr_ConfigSystemTick();  // Systick timer is required for print-Period
			
      //	NVIC_EnableIRQ (BusFault_IRQn);
      //	NVIC_SetPriority (BusFault_IRQn, 0x08);
    SCB->SHCSR |= (1<< 17);		// Bus Fault enabled
    SCB->SHCSR |= (1<< 16);		// Memory Management Fault enabled
	
    // Config Memory Protection Unit
    // =============================
    // Region 0: define protected region = region no. 0
    // ------------------------------------------------
    MPU->RNR  = 0;		// region number
    // set base adress of region, set valid, select region
    MPU->RBAR = 0x60000000 | MPU_RBAR_VALID_Msk | 0x0;
    // Size and Type,   enable             2^21 Bytes   SRAM 111     0: all access protected, 7: read only
    //                  Bit 0           |  Bits 5:1 | Bits SCB 18:16 |  AP  26:24   //  | Tex 19:21
    MPU->RASR =     MPU_RASR_ENABLE_Msk | (20 << 1) |  ( 7 << 16)    | (0 << 24);   // | (0x6 <<19);

//    // Region 1: define protected region = region no. 1
//    // ------------------------------------------------
//    MPU->RNR  = 1;		// region number
//    // set base adress of region, set valid, select region 
//    MPU->RBAR = 0x60100000 | MPU_RBAR_VALID_Msk | 0x1;
//    // Size and Type,   enable             2^19 Bytes   SRAM 111     0: all access protected, 7: read only
//    //                  Bit 0           |  Bits 5:1 | Bits SCB 18:16 |  AP  26:24
//    MPU->RASR =     MPU_RASR_ENABLE_Msk | (18 << 1) |  ( 7 << 16)    | (0 << 24); 
    //
    // activate MPU
    // ------------
    // 					Bit 2, Enable Default Region    Bit 0, enable MPU
    MPU->CTRL  =  MPU_CTRL_PRIVDEFENA_Msk | MPU_CTRL_ENABLE_Msk;
  
    // clear emulated display RAM  
      for (i=0; i<320; i++){
        for (j=0; j<239; j++) {
          lcdmatrix[j][i] = ' ';
      }}       
      xcursor = 0; ycursor=0;
      for (i=0; i<16; i++) {ledsarray[i]=0;}
      flag_init = 1;
  }	// end if else
	
  
} // end Emulate_LEDsLCD


