luk8426/microcontroller/_mcpr_stm32f407_all.c
// Catches accesses to HW-adresses of LEDs and LCDs
void MemManage_Handler(void) {
//void HardFault_Handler(void) {
  unsigned int volatile stat;
  unsigned int * stackp, i=0;

  // locate stack  
  unsigned int spReg, lrReg, pcReg;
    __asm {
      MOV spReg, __current_sp()
      MOV pcReg, __current_pc()
      MOV lrReg, __return_address()
    }

  // emulate LCD-commands    
  Interpret_LEDsLCD(1);

  // save fault adress  
  stat = SCB->CFSR;
  hwaccess_adress  = SCB->MMFAR;     // Memory Manage Fault Adress Register (name datasheed: MMAR
	*(unsigned char *) &(SCB->CFSR) = 0xff;
  SCB->CFSR &= ~SCB_CFSR_MMARVALID_Msk;
  SCB->CFSR &= ~SCB_CFSR_DACCVIOL_Msk;
//	*(unsigned char *) &(SCB->CFSR) = 0;

  // locate fault adress in stack (typ. +6*4 above lower end, (top stack adress is decreased by push)  
  i   = 0;
  stackp = ((unsigned int*) spReg);
  while ( (*stackp != hwaccess_adress) && (i<12) ) {
      stackp++;
      i++;
  }
  // redirect next write to RAM variable to catch data  
  if (i<12) { 
     *stackp =  (unsigned int)&hwaccess_data;
     qflag = 1;   // valid data in hwaccess_data at next entry
  } else {  // wrong fault 
     qflag = 0;
     invalid++;
  }
  
  // The pc, lr, and sp registers cannot be explicitly read or modified using inline assembly code 
  //  because there is no direct access to any physical registers. 
  // However, you can use the intrinsics __current_pc, __current_sp, and __return_address to read these registers.
  
}

//void HardFault_Handler(void) {
////void BusFault_Handler(void) {
////    busfaultcounter++;
//  hwhfa = 0x08000000;
//	*(unsigned char *) &(SCB->CFSR) = 0xff;
//}



/*----------------------------------------------------------------------------
  SysTick_Handler
 *----------------------------------------------------------------------------*/
void SysTick_Handler(void) {
	int static is=0;
	if (is) {
		is--;
	} else {
		is = PRINTPERIODms;
    time2printflag = 1;
//		LED_Toggle(1);
	}
}

#else

void Emulate_RKTYC (signed short invtemp){};
void Emulate_LEDsLCD (unsigned int rows, unsigned int cols) {}

void SysTick_Handler(void) {
	int static is=0;
	if (is) {
		is--;
	} else {
//		LED_Toggle(1);
	}
}

#endif  // end use of emulator for LCD and LEDS


/* From original system_stm32f4xx.c                                           
  ******************************************************************************
  ******************************************************************************
  ******************************************************************************
  ******************************************************************************
*/

/**
  ******************************************************************************
  * @file    system_stm32f4xx.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    30-September-2011
  * @brief   CMSIS Cortex-M4 Device Peripheral Access Layer System Source File.
  *          This file contains the system clock configuration for STM32F4xx devices,
  *          and is generated by the clock configuration tool
  *          stm32f4xx_Clock_Configuration_V1.0.0.xls
  *             
  * 1.  This file provides two functions and one global variable to be called from 
  *     user application:
  *      - SystemInit(): Setups the system clock (System clock source, PLL Multiplier
  *                      and Divider factors, AHB/APBx prescalers and Flash settings),
  *                      depending on the configuration made in the clock xls tool. 
  *                      This function is called at startup just after reset and 
  *                      before branch to main program. This call is made inside
  *                      the "startup_stm32f4xx.s" file.
  *
  *      - SystemCoreClock variable: Contains the core clock (HCLK), it can be used
  *                                  by the user application to setup the SysTick 
  *                                  timer or configure other parameters.
  *                                     
  *      - SystemCoreClockUpdate(): Updates the variable SystemCoreClock and must
  *                                 be called whenever the core clock is changed
  *                                 during program execution.
  *
  * 2. After each device reset the HSI (16 MHz) is used as system clock source.
  *    Then SystemInit() function is called, in "startup_stm32f4xx.s" file, to
  *    configure the system clock before to branch to main program.
  *
  * 3. If the system clock source selected by user fails to startup, the SystemInit()
  *    function will do nothing and HSI still used as system clock source. User can 
  *    add some code to deal with this issue inside the SetSysClock() function.
  *
  * 4. The default value of HSE crystal is set to 8 MHz, refer to "HSE_VALUE" define
  *    in "stm32f4xx.h" file. When HSE is used as system clock source, directly or
  *    through PLL, and you are using different crystal you have to adapt the HSE
  *    value to your own configuration.
  *
  * 5. This file configures the system clock as follows:
  *=============================================================================
  *=============================================================================
  *        Supported STM32F4xx device revision    | Rev A
  *-----------------------------------------------------------------------------
  *        System Clock source                    | PLL (HSE)
  *-----------------------------------------------------------------------------
  *        SYSCLK(Hz)                             | 168000000
  *-----------------------------------------------------------------------------
  *        HCLK(Hz)                               | 168000000
  *-----------------------------------------------------------------------------
  *        AHB Prescaler                          | 1
  *-----------------------------------------------------------------------------
  *        APB1 Prescaler                         | 4
  *-----------------------------------------------------------------------------
  *        APB2 Prescaler                         | 2
  *-----------------------------------------------------------------------------
  *        HSE Frequency(Hz)                      | 8000000
  *-----------------------------------------------------------------------------
  *        PLL_M                                  | 8
  *-----------------------------------------------------------------------------
  *        PLL_N                                  | 336
  *-----------------------------------------------------------------------------
  *        PLL_P                                  | 2
  *-----------------------------------------------------------------------------
  *        PLL_Q                                  | 7
  *-----------------------------------------------------------------------------
  *        PLLI2S_N                               | NA
  *-----------------------------------------------------------------------------
  *        PLLI2S_R                               | NA
  *-----------------------------------------------------------------------------
  *        I2S input clock                        | NA
  *-----------------------------------------------------------------------------
  *        VDD(V)                                 | 3.3
  *-----------------------------------------------------------------------------
  *        Main regulator output voltage          | Scale1 mode
  *-----------------------------------------------------------------------------
  *        Flash Latency(WS)                      | 5
  *-----------------------------------------------------------------------------
  *        Prefetch Buffer                        | OFF
  *-----------------------------------------------------------------------------
  *        Instruction cache                      | ON
  *-----------------------------------------------------------------------------
  *        Data cache                             | ON
  *-----------------------------------------------------------------------------
  *        Require 48MHz for USB OTG FS,          | Enabled
  *        SDIO and RNG clock                     |
  *-----------------------------------------------------------------------------
  *=============================================================================
  ****************************************************************************** 
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f4xx_system
  * @{
  */  
  
/** @addtogroup STM32F4xx_System_Private_Includes
  * @{
  */

// #include "stm32f4xx.h"

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Defines
  * @{
  */


