luk8426/microcontroller/_mcpr_stm32f407_all.c
/************************* PLL Parameters *************************************/
/* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLL_M) * PLL_N */
#define mcpr_PLL_M      8
#define mcpr_PLL_N      336

/* SYSCLK = PLL_VCO / PLL_P */
#define mcpr_PLL_P      2

/* USB OTG FS, SDIO and RNG Clock =  PLL_VCO / PLLQ */
#define mcpr_PLL_Q      7

/******************************************************************************/

/******************************************************************************/
#if !defined  (mcpr_HSE_STARTUP_TIMEOUT) 
  #define mcpr_HSE_STARTUP_TIMEOUT    ((uint16_t)0x0600)   /*!< Time out for HSE start up */
#endif /* HSE_STARTUP_TIMEOUT */   

/******************************************************************************/
/**
  * @}
  */





/** @addtogroup STM32F4xx_System_Private_Functions
  * @{
  */


/**
   * @brief  Update SystemCoreClock variable according to Clock Register Values.
  *         The SystemCoreClock variable contains the core clock (HCLK), it can
  *         be used by the user application to setup the SysTick timer or configure
  *         other parameters.
  *           
  * @note   Each time the core clock (HCLK) changes, this function must be called
  *         to update SystemCoreClock variable value. Otherwise, any configuration
  *         based on this variable will be incorrect.         
  *     
  * @note   - The system frequency computed by this function is not the real 
  *           frequency in the chip. It is calculated based on the predefined 
  *           constant and the selected clock source:
  *             
  *           - If SYSCLK source is HSI, SystemCoreClock will contain the HSI_VALUE(*)
  *                                              
  *           - If SYSCLK source is HSE, SystemCoreClock will contain the HSE_VALUE(**)
  *                          
  *           - If SYSCLK source is PLL, SystemCoreClock will contain the HSE_VALUE(**) 
  *             or HSI_VALUE(*) multiplied/divided by the PLL factors.
  *         
  *         (*) HSI_VALUE is a constant defined in stm32f4xx.h file (default value
  *             16 MHz) but the real value may vary depending on the variations
  *             in voltage and temperature.   
  *    
  *         (**) HSE_VALUE is a constant defined in stm32f4xx.h file (default value
  *              25 MHz), user has to ensure that HSE_VALUE is same as the real
  *              frequency of the crystal used. Otherwise, this function may
  *              have wrong result.
  *                
  *         - The result of this function could be not correct when using fractional
  *           value for HSE crystal.
  *     
  * @param  None
  * @retval None
  */


/**
  * @brief  Configures the System clock source, PLL Multiplier and Divider factors, 
  *         AHB/APBx prescalers and Flash settings
  * @Note   This function should be called only once the RCC clock configuration  
  *         is reset to the default reset state (done in SystemInit() function).   
  * @param  None
  * @retval None
  */
static void mcpr_SetSysClock(void)
{
/******************************************************************************/
/*            PLL (clocked by HSE) used as System clock source                */
/******************************************************************************/
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0;

  SystemCoreClock = 168000000;				// defined in system_stm32f4xx.c
  
  /* Enable HSE */
  RCC->CR |= ((uint32_t)RCC_CR_HSEON);
 
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CR & RCC_CR_HSERDY;
    StartUpCounter++;
  } while((HSEStatus == 0) && (StartUpCounter != mcpr_HSE_STARTUP_TIMEOUT));

  if ((RCC->CR & RCC_CR_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }

  if (HSEStatus == (uint32_t)0x01)
  {
    /* Select regulator voltage output Scale 1 mode, System frequency up to 168 MHz */
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;
    PWR->CR |= PWR_CR_VOS;

    /* HCLK = SYSCLK / 1*/
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
      
    /* PCLK2 = HCLK / 2*/
    RCC->CFGR |= RCC_CFGR_PPRE2_DIV2;
    
    /* PCLK1 = HCLK / 4*/
    RCC->CFGR |= RCC_CFGR_PPRE1_DIV4;

    /* Configure the main PLL */
    RCC->PLLCFGR = mcpr_PLL_M | (mcpr_PLL_N << 6) | (((mcpr_PLL_P >> 1) -1) << 16) |
                   (RCC_PLLCFGR_PLLSRC_HSE) | (mcpr_PLL_Q << 24);

    /* Enable the main PLL */
    RCC->CR |= RCC_CR_PLLON;

    /* Wait till the main PLL is ready */
    while((RCC->CR & RCC_CR_PLLRDY) == 0)
    {
    }
   
    /* Configure Flash prefetch, Instruction cache, Data cache and wait state */
    FLASH->ACR = FLASH_ACR_ICEN |FLASH_ACR_DCEN |FLASH_ACR_LATENCY_5WS;

    /* Select the main PLL as system clock source */
    RCC->CFGR &= (uint32_t)((uint32_t)~(RCC_CFGR_SW));
    RCC->CFGR |= RCC_CFGR_SW_PLL;

    /* Wait till the main PLL is used as system clock source */
    while ((RCC->CFGR & (uint32_t)RCC_CFGR_SWS ) != RCC_CFGR_SWS_PLL);
    {
    }
  }
  else
  { /* If HSE fails to start-up, the application will have wrong clock
         configuration. User can add here some code to deal with this error */
  }

}





/**
  * @brief  Setup the external memory controller.
  *         Called in startup_stm32f4xx.s before jump to main.
  *         This function configures the external memories (SRAM/SDRAM)
  *         This SRAM/SDRAM will be used as program data memory (including heap and stack).
  * @param  None
  * @retval None
  */
void SystemInit_ExtMemCtl(void)
{

#if defined(USE_FSMC)

	
  __IO uint32_t tmp = 0x00;

#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx) || defined(STM32F417xx)\
 || defined(STM32F427xx) || defined(STM32F437xx) || defined(STM32F429xx) || defined(STM32F439xx)\
 || defined(STM32F469xx) || defined(STM32F479xx) || defined(STM32F412Zx) || defined(STM32F412Vx)

	
/*-- LCD, LEDs address decoding on lab evaluation board */ 
	// 0 1 significant, o unused
	// byte-address LCD: 31-   27-     23- 20    19- 17	 16   15-
	// byte-address LCD: 0110  00  oo  ooo 0/1   oo  0/1  o   oooo oooo oooo oooo
	//                   FMSC  NE1         C/D     LCD/LEDs
	// notice: address signals in following are named as halfword (2byte) signals
	//         e.g. A19 halfword address signal corresponds to bit 20 of byte-address

/*-- GPIOs Configuration -----------------------------------------------------*/
/* Enable GPIOD, GPIOE, GPIOF and GPIOG interface clock */
	// STM32F407: nur GPIOD, GPIOE
	//    NE1=PD7, A16=PD11 (0=LCD, 1=LEDs), A19=PE3 (0=Command, 1=Data),  NOE=PD4, NWE=PD5, 
	//    D0-1=PD14-15, D2-3=PD0-1, D4-12=PE7-15, D13-15=PD8-10
  RCC->AHB1ENR   |= 0x00000018;
  /* Delay after an RCC peripheral clock enabling */
  tmp = READ_BIT(RCC->AHB1ENR, RCC_AHB1ENR_GPIODEN);

  /* GPIOD Configuration */
	// PD 15  14  13  12  11  10   9   8   7   6   5   4   3   2   1   0
	//    D1  D0  -   -   A16 D15 D14 D13 NE1  -  NWE NOE  -   -  D3  D2
	//
  /* Connect PDx pins to FMC Alternate function, AF12=FSMC */
  GPIOD->AFR[0]  = 0xC0CC00CC;
  GPIOD->AFR[1]  = 0xCC00CCCC;
	/* Configure PDx pins in Alternate function mode, AF=10, Input=00*/  
	GPIOD->MODER   = 0xA0AA8A0A;
  /* Modified Ga: keep reset-configuration (00= min. speed) to avoid EMI!, Configure PEx pins speed to 100 MHz, 11=max. speed */ 
	//  GPIOD->OSPEEDR = 0xF0FFCF0F;
  /* Configure PDx pins Output type to push-pull, 0=push-pull */  
  GPIOD->OTYPER  = 0x00000000;
  /* No pull-up, pull-down for PDx pins, 00=no */ 
  GPIOD->PUPDR   = 0x00000000;
	
  /* GPIOE Configuration */
	// PE 15  14  13  12  11  10   9   8   7   6   5   4   3   2   1   0
	//    D12 D11 D10 D9  D8  D7  D6  D5  D4   -   -   - A19   -   -   -
	//
  /* Connect PEx pins to FMC Alternate function, AF12=FSMC  */
  GPIOE->AFR[0]  = 0xC000C000;
  GPIOE->AFR[1]  = 0xCCCCCCCC;
  /* Configure PEx pins in Alternate function mode, AF=10, Input=00 */ 
  GPIOE->MODER   = 0xAAAA8080;
  /* Modified Ga: keep reset-configuration (00= min. speed) to avoid EMI!, Configure PEx pins speed to 100 MHz, 11=max. speed */ 
	//  GPIOE->OSPEEDR = 0xFFFFC0C0;
  /* Configure PEx pins Output type to push-pull */  
  GPIOE->OTYPER  = 0x00000000;
  /* No pull-up, pull-down for PEx pins */ 
  GPIOE->PUPDR   = 0x00000000;
  
/*-- FMC/FSMC Configuration --------------------------------------------------*/
/* Enable the FMC/FSMC interface clock, AHB3ENR.Bit0=1 enables FSMC */
  RCC->AHB3ENR         |= 0x00000001;


