luk8426/microcontroller/_mcpr_stm32f407_all.c
#if defined(STM32F405xx) || defined(STM32F415xx) || defined(STM32F407xx)|| defined(STM32F417xx)\
   || defined(STM32F412Zx) || defined(STM32F412Vx)
  /* Delay after an RCC peripheral clock enabling */
  tmp = READ_BIT(RCC->AHB3ENR, RCC_AHB3ENR_FSMCEN);
/* Configure FSMC */
/*   only NE1 is used -> FSMC_BCR1, FSMC_BTR1, ... have to be configured */
// (register naming does not match datasheet, in particalar "Bank1")
// Register structure datasheet  <-> stm32f407xx.h
// FSMC_Bank1->BTCR[0]  <-> FSMC_BCR1 chip-select control register Bank1
// FSMC_Bank1->BTCR[1]  <-> FSMC_BTR1 chip-select timing register Bank1
// FSMC_Bank1->BTCR[2]  <-> FSMC_BCR2
// FSMC_Bank1->BTCR[3]  <-> FSMC_BTR2
// ...                      ........4
// 
// FSMC_BCR1  Bits 
//   31-20 19 18-16 15 14 13 12  11 10  9  8   7  6  5-4   3-2  1  0
//     0  | 0  000 | 0  0  0  1 | 0  0  0  0 | 1  0   01 |  00  0  1    = 0x00001091
//     |    |   |    |  |  |  |   |  |  |  |   |  |    |     |  |  |										 
//     |    |   |    |  |  |  |   |  |  |  |   |  |    |     |  |  +-> MBKEN     0/1 Bank disabled / enabled
//     |    |   |    |  |  |  |   |  |  |  |   |  |    |     |  +----> MUXEN     0/1 non-multiplexed / multiplexed A/D-bus
//     |    |   |    |  |  |  |   |  |  |  |   |  |    |     +-------> MTYP      00=SRAM, 01=NOR-Flash										 
//     |    |   |    |  |  |  |   |  |  |  |   |  |    +-------------> MWID      00=8bit D-bus, 01=16bit D-bus
//     |    |   |    |  |  |  |   |  |  |  |   |  +------------------> FACCEN    0/1 NOR-Flash access disabled/enabled
//     |    |   |    |  |  |  |   |  |  |  |   +---------------------> reserved  (reset state = 1 ?)
//     |    |   |    |  |  |  |   |  |  |  +-------------------------> BURSTEN   0/1 disable/enable burst mode (only in sync-mode)
//     |    |   |    |  |  |  |   |  |  +----------------------------- WAITPOL   0/1 active low/high NWAIT-polarity
//     |    |   |    |  |  |  |   |  +-------------------------------> WRAPMOD   0/1 wrapped
//     |    |   |    |  |  |  |   +----------------------------------- WAITCFG   0/1 wait timing one before/during (sync. mode, only if Wait enabled) 
//     |    |   |    |  |  |  +--------------------------------------> WREN      0/1 Write disable/enable
//     |    |   |    |  |  +-----------------------------------------> WAITEN    0/1 Wait (signal) disable/enable, sync. mode
//     |    |   |    |  +--------------------------------------------> EXTMOD    0/1 disable/enable ext. write timing for async (BWTR-Reg.), 0: only mode 1 for SRAM
//     |    |   |    +-----------------------------------------------> ASCYCWAIT 0/1 Wait (signal) disable/enable, async. mode    
//     |    |   +----------------------------------------------------> reserved  (reset state = 000) 
//	   |    +--------------------------------------------------------> CBURSTRW  0/1 disable/enable write burst (for sync. mode), 0: write always in async. mode
//     +--- reserved, 0

	FSMC_Bank1->BTCR[0]  = 0x00001091;	// SRAM, async. mode, wait-signal disabled, mode 1 = NEW toggles, NOE=Low during whole read cycle!

// FSMC_BTR1  
//   Bits 31-30 29-28 27-24  23-20  19-16   15-8   7-4    3-0
//         00    00  | 0000 | 0000 | 0001 | 1111 | 0000 | 1111   = 0x00001F0F
//          |     |      |      |      |      |      |      |
//          |     |      |      |      |      |      |      +-> ADDSET  X*HCLK cycles address set up (=delay of NWE=LOW)
//          |     |      |      |      |      |      +--------- ADDHLD  (used in D-mode and multiplexed modes, needs EXTMOD=1), 0000=reserved?
//          |     |      |      |      |      +---------------> DATAST  data access time (X+1)*HCLK for write access
//          |     |      |      |      +----------------------> BUSTURN X*HCKL delay added between consecutive access (= min. NEx=HIGH ?)
//          |     |      |      +------------------------------ CLKDIV  (sync. mode, divider for CLK output signal)
//          |     |      +------------------------------------- DATLAT  (sync. NOR-Flash, data latency)
//          |     +-------------------------------------------- ACCMOD  (only if EXTMOD=1 in BCR-register, selects mode A...D)
//          +--- reserved, 0


  FSMC_Bank1->BTCR[1]  = 0x00040808;		// optimum: 0x00020606;  // default used:  0x00040808
	//  req. LCD: tcycle (CS 1-0 edges): min 77ns (> 13 HCLK @ 168MHz)


#endif /* STM32F405xx || STM32F415xx || STM32F407xx || STM32F417xx || STM32F412Zx || STM32F412Vx */

#endif /* STM32F405xx || STM32F415xx || STM32F407xx || STM32F417xx || STM32F427xx || STM32F437xx ||\
          STM32F429xx || STM32F439xx || STM32F469xx || STM32F479xx || STM32F412Zx || STM32F412Vx  */ 
  (void)(tmp); 


#elif defined(NO_FSMC)
     // keine Initialisierung notwendig
#else
	#error Definition of FSMC macro is missing 
#endif 	// USE_/NO_FSMC


}






// now in ..\RTE\Device\STM32F407VGTx\system_stm32f4xx.c per CMSIS / Device-Config.
//void SystemCoreClockUpdate(void)
//{
//  uint32_t tmp = 0, pllvco = 0, pllp = 2, pllsource = 0, pllm = 2;
//  
//  /* Get SYSCLK source -------------------------------------------------------*/
//  tmp = RCC->CFGR & RCC_CFGR_SWS;

//  switch (tmp)
//  {
//    case 0x00:  /* HSI used as system clock source */
//      SystemCoreClock = HSI_VALUE;
//      break;
//    case 0x04:  /* HSE used as system clock source */
//      SystemCoreClock = HSE_VALUE;
//      break;
//    case 0x08:  /* PLL used as system clock source */

//      /* PLL_VCO = (HSE_VALUE or HSI_VALUE / PLL_M) * PLL_N
//         SYSCLK = PLL_VCO / PLL_P
//         */    
//      pllsource = (RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) >> 22;
//      pllm = RCC->PLLCFGR & RCC_PLLCFGR_PLLM;
//      
//      if (pllsource != 0)
//      {
//        /* HSE used as PLL clock source */
//        pllvco = (HSE_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 6);
//      }
//      else
//      {
//        /* HSI used as PLL clock source */
//        pllvco = (HSI_VALUE / pllm) * ((RCC->PLLCFGR & RCC_PLLCFGR_PLLN) >> 6);      
//      }

//      pllp = (((RCC->PLLCFGR & RCC_PLLCFGR_PLLP) >>16) + 1 ) *2;
//      SystemCoreClock = pllvco/pllp;
//      break;
//    default:
//      SystemCoreClock = HSI_VALUE;
//      break;
//  }
//  /* Compute HCLK frequency --------------------------------------------------*/
//  /* Get HCLK prescaler */
//  tmp = AHBPrescTable[((RCC->CFGR & RCC_CFGR_HPRE) >> 4)];
//  /* HCLK frequency */
//  SystemCoreClock >>= tmp;
//}

/**
  * @}
  */

/**
  * @}
  */
  
/**
  * @}
  */    
	
	
/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/
